app/controllers/casein/apps_controller.rb

SELECT `apps`.* FROM `apps` WHERE (name='마이시티' and appId='13046') LIMIT 1
---
        }

        if orderType == "1" || orderType == "POPULARITY"
          r.app.ranks.hot.each do |r|

SELECT COUNT(*) AS count_id FROM `apps`
SELECT `apps`.* FROM `apps` LIMIT 0, 30
---

      @apps
      if @platform == "naver"
        @apps = App.naver.paginate :page => params[:page]

SELECT `apps`.* FROM `apps` WHERE (name='퀴즈스캔들' and appId='1556\'') LIMIT 1
INSERT INTO `ranks` (`app_id`, `created_at`, `downloadCount`, `orderType`, `rank`, `rating`, `updated_at`) VALUES (157, '2011-04-17 06:57:09', 2027, '1', 29, 4.8, '2011-04-17 06:57:09')
---
    def show
      @casein_page_title = 'View app'
      # @app = App.find params[:id]

      @app = App.find(params[:id])

      @rankData = []
      @orderType = params[:orderType] || ((@app.platform == "nate")? "2" : "INSTALL")

      @app.ranks.find(:all, :conditions=>{:orderType=>@orderType}).each do |r|
        @rankData << [r.created_at.localtime.to_time.to_i*1000, r.downloadCount]