app/controllers/casein/ranks_controller.rb

SELECT COUNT(*) AS count_id FROM `ranks`
SELECT `ranks`.* FROM `ranks` LIMIT 0, 30
---
    def index
      @casein_page_title = 'Ranks'
  		@ranks = Rank.paginate :page => params[:page]