app/controllers/apps_controller.rb

SELECT `apps`.* FROM `apps`
---
  def index
    @graphData = []
    ranks = Rank.find(:all,
      :limit=>10,
      :order => "rank ASC",
      :conditions=>["orderType=? and created_at > ?", 1, 1.days.ago])

    ranks.each do |r|
      obj =  {
        :label=>r.app.name,
        :data=>[]
      }
      r.app.ranks.each do |r|

SELECT `apps`.* FROM `apps` WHERE (`apps`.`id` = 1) LIMIT 1
---
  def show
    @app = App.find(params[:id])